Revit 2027 API
ParameterTypeId.RebarShapeCrankEndLength Property
 "End Crank Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarShapeCrankEndLength { get; }
Public Shared ReadOnly Property RebarShapeCrankEndLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarShapeCrankEndLength {
	ForgeTypeId^ get ();
}
static member RebarShapeCrankEndLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace